Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/death_related_benefits/social_welfare_payments_following_a_death.html.txt.tmx
Source language: en
Languages: ga

source: Social welfare payments following a death
ga: Íocaíochtaí leasa shóisialaigh tar éis bás duine

source: • Rates • How to apply
ga: • Conas iarratas a dhéanamh

source: Death of the person claiming a social welfare payment
ga: Bás duine atá ag éileamh íocaíochta leasa shóisialaigh

source: Some social welfare payments can continue after someone dies
ga: Leanann roinnt íocaíochtaí leasa shóisialaigh tar éis do dhuine bás a fháil

source: That is, where someone who was getting a certain social welfare payment dies, their spouse, civil partner or cohabitant may get 6 weeks of this payment after the death
ga: Is é sin, i gcás bás duine a bhí ag fáil íocaíochta leasa shóisialaigh ar leith, d’fhéadfadh sé go bhfaigheadh a gcéile/páirtnéir sibhialta/comhchónaitheoir 6 seachtaine den íocaíocht seo tar éis an bháis

source: This will be paid at the same rate your late spouse, civil partner or cohabitant was getting
ga: Íocfar an íocaíocht 6 seachtaine seo ag an ráta céanna a bhí á fháil ag do chéile/páirtnéir sibhialta/comhchónaitheoir básaithe

source: You may get the 6-week payment if your spouse, civil partner or cohabitant was getting one of the following payments and it included a payment (Increase for a Qualified Adult) for you:
ga: B’fhéidir go bhfaighidh tú an íocaíocht 6 seachtaine má bhí do chéile/páirtnéir sibhialta/comhchónaitheoir ag fáil ceann de na híocaíochtaí seo a leanas agus má bhí íocaíocht (Méadú le haghaidh Duine Fásta Cáilithe) san áireamh inti duitse:

source: • State Pension (Non-Contributory) or State Pension (Contributory)
ga: • Pinsean Stáit (Neamh-Ranníocach) nó Pinsean Stáit (Ranníocach)

source: • Jobseeker's Benefit or Jobseeker's Allowance
ga: • Sochar Cuardaitheora Poist nó Liúntas Cuardaitheora Poist

source: • Injury Benefit or Incapacity Supplement
ga: • Sochar Díobhála nó Forlíonadh Éagumais

source: If you are getting any of the payments listed above and your deceased spouse, civil partner or cohabitant was also getting one of the payments listed above in his or her own right, you may also continue to get your spouse's, civil partner's or cohabitant's payment for 6 weeks after their death, plus your own payment
ga: Má tá tú ag fáil ceann de na híocaíochtaí leasa shóisialaigh atá liostaithe thuas agus má fuair do chéile/páirtnéir sibhialta/comhchónaitheoir marbh ceann de na híocaíochtaí leasa shóisialaigh atá liostaithe thuas ina cheart féin, is féidir leat lean ag fáil íocaíocht do chéile/páirtnéir sibhialta/comhchónaitheoir ar feadh 6 sheachtain i ndiaidh an bháis de bhreis ar d'íocaíocht féin

source: Death of an adult dependant
ga: Bás duine fásta cáilithe

source: If you are getting a social welfare payment that included a payment (Increase for a Qualified Adult) for your late spouse, civil partner or cohabitant, you will continue to get the same rate of payment for 6 weeks after their death
ga: Má tá tú ag fáil íocaíochta leasa shóisialaigh a chuimsigh íocaíocht (Méadú do Dhuine Fásta Cáilithe) dod’ chéile/páirtnéir sibhialta/comhchónaitheoir nach maireann, leanfaidh tú ag fáil an ráta céanna íocaíochta ar feadh 6 seachtaine tar éis a b(h)áis

source: If your child dies, payment of an Increase for a Qualified Child on your social welfare payment will usually continue for 6 weeks, if the child was included in your payment
ga: Má fhaigheann do leanbh bás, is hiondúil go leanfaidh an íocaíocht Méadú do Leanbh Cáilithe ar feadh 6 seachtaine, má bhí an leanbh cuimsithe i d’íocaíocht

source: Contact the section of the Department of Social Protection responsible for your payment
ga: Téigh i dteagmháil leis an rannóg den Roinn Coimirce Sóisialaí atá freagrach as d’íocaíocht

source: You should also notify the Child Benefit Section of the Department about the death of the child
ga: Ba chóir duit an Rannóg Sochar Leanaí den Roinn a chur ar an eolas freisin faoi bhás an linbh

source: Where a person being cared for dies
ga: Sa chás go bhfaigheann duine a bhfuil cúram á thabhairt dó/di bás

source: Payment of Carer's Allowance (full or half-rate) continues to be made for 12 weeks after the death of the person you were caring for
ga: Leantar le Liúntas Cúramóra (ráta iomlán nó leathráta) a íoc ar feadh 12 sheachtain i ndiaidh go bhfaigheann an duine a raibh cúram á thabhairt agat dó/di bás

source: Payment of Carer's Benefit continues to be made for 6 weeks after the death of the person you were caring for
ga: Leantar le Sochar Cúramóra a íoc ar feadh 6 seachtaine i ndiaidh go bhfaigheann an duine a raibh cúram á thabhairt agat dó/di bás

source: If you are getting Carer’s Allowance (full or half-rate) on behalf of a spouse, civil partner or cohabitant and that person dies, you can continue to get Carer's Allowance for 12 weeks plus any of the payments listed above (if in payment to that person) for 6 weeks after the date of death
ga: Má tá Liúntas Cúramóra (ráta iomlán nó leathráta) á fháil agat thar ceann céile, páirtnéir sibhialta nó comháitritheora agus má fhaigheann an duine sin bás, féadfaidh tú leanúint le Liúntas Cúramóra a fháil ar feadh 12 sheachtain anuas ar aon chinn de na híocaíochtaí a liostaítear thuas (má tá siad á n-íoc leis an duine sin) a feadh 6 seachtain i ndiaidh dháta an bháis

source: If you were getting Carer’s Benefit you continue to get it for 6 weeks and any payments your spouse or partner was getting
ga: Má bhí Sochar Cúramóra á fháil agat, féadfaidh tú leanúint lena fháil ar feadh 6 seachtaine, anuas ar aon íocaíochtaí a bhí á bhfáil ag do chéile nó do pháirtnéir

source: If you are getting one of the other payments listed above and your deceased spouse, civil partner or cohabitant was getting Carer's Allowance for you, you will continue to get your payments plus Carer’s Allowance (full or half-rate) for 6 weeks after the date of death
ga: Má tá ceann de na híocaíochtaí á fháil agat a liostaítear thuas agus má bhí Liúntas Cúramóra á fháil ag do chéile, páirtnéir sibhialta nó do chomháitritheoir, a fuair bás, leanfaidh tú le d’íocaíochtaí a fháil, anuas ar Liúntas Cúramóra (ráta iomlán nó leathráta) ar feadh 6 seachtaine i ndiaidh dháta an bháis

source: You continue to get Carer's Benefit for 6 weeks
ga: Féadfaidh tú leanúint le Sochar Cúramóra a fháil ar feadh 6 seachtaine

source: In all cases you must inform the Department of Social Protection of the death
ga: I ngach cás, caithfidh tú an Roinn Coimirce Sóisialaí a chur ar an eolas ar an mbás

source: The 6-week payment is normally paid in a lump sum by cheque
ga: Conas iarratas a dhéanamh

source: To apply for a payment after death, you should contact the appropriate section within the Department of Social Protection, as soon as possible following the death
ga: Chun iarratas a dhéanamh ar íocaíocht tar éis bás duine, ba chóir duit dul i dteagmháil leis an rannóg cuí sa Roinn Coimirce Sóisialaí, chomh luath agus is féidir tar éis an bháis

source: (The section you need to contact will depend on the type of payment the deceased received
ga: (Braitheann an rannóg a mbeidh teagmháil le déanamh agat leo, ar an gcineál íocaíochta a fuair an duine nach maireann

source: For example, if the person who died was getting a State Pension, you need to get in touch with the Pension Section of the Department, etc.)
ga: Mar shampla, má bhí an duine nach maireann ag fáil Pinsin Scoir, beidh ort dul i dteagmháil leis an Rannóg Pinsin den Roinn, srl.)

source: Staff in your local Intreo centre or social welfare office can advise if you are not sure where to contact
ga: Is féidir leis an bhfoireann oibre i d’oifig leasa shóisialaigh áitiúil comhairle a chur ort mura bhfuil tú cinnte cén áit is fearr duit teagmháil a dhéanamh léi

source: Enclose the death certificate (if available) or a death notice from a newspaper with your application
ga: Ní mór duit an leabhar/ na leabhair íocaíochta nó an seic, má tá a leithéid agat, a bheith iniata freisin

source: A cheque will be sent to you
ga: Seolfar seic i gcomhair na híocaíochta 6 seachtaine
